Tekla Open API Reference for Tekla Structures 2025
MaterialItem.MaterialNameMaxLength Method
 Returns the maximum length a material name can be.
 Namespace: Tekla.Structures.Catalogs
 Assembly: Tekla.Structures.Catalogs (in Tekla.Structures.Catalogs.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public static int MaterialNameMaxLength()
Public Shared Function MaterialNameMaxLength As Integer
Return Value
Type: Int32
The maximum length.
See Also
Reference
MaterialItem Class
Tekla.Structures.Catalogs Namespace